[
  {
    "id": 1,
    "rating": 5,
    "userName": "Liisa",
    "text": "Exceptional. Perfect location right next to the ocean and a safe spot for swimming. Excellent food and comfy rooms. The best thing about this accommodation is the staff, who go above and beyond to make your stay a true paradise holiday. They looked after our every need and also planned us many trips to interesting locations. Our only job was to relax, relax, relax. If you're expecting a huge mansion with marble floors, this may not be the place for you. For us the cabins provided everything we needed: security, air conditioning and privacy.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Food",
      "Staff"
    ],
    "source": "Booking.com",
    "date": "Dec 01, 2025",
    "status": "Pending"
  },
  {
    "id": 2,
    "rating": 5,
    "userName": "Pierre",
    "text": "A great place to see the sunrise from bed…. The way we were welcomed, the location, the cabin, the staff very generous with their time and smile. The food was real good. A special place to discover.. It was all perfect, but to be sure to get a good choice of fresh seafood its a good idea to call them 24 hours before arrival.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Food"
    ],
    "source": "Booking.com",
    "date": "Mar 01, 2025",
    "status": "Pending"
  },
  {
    "id": 3,
    "rating": 5,
    "userName": "Grün",
    "text": "Insider Tip. We are a young couple from Austria and found the villas through coincidence. We recently spent a few nights at the Tomorrowland Hostel in Ella. (where the hospitality far exceeded typical hostel standards.) When we mentioned our plans to travel to the South Coast, Tomorrowland’s Guest Relations Officer, Pooja, introduced us to their brand-new upscale boutique property—Tomorrowland Beach Villas in Rekawa, Tangalle—promising a luxurious all-inclusive experience. We decided to give it a try. From the moment we arrived at the property, it felt like a slice of paradise. We were warmly welcomed by two wonderful hosts who greeted us with cool, refreshing towels and freshly squeezed fruit juices—an incredibly thoughtful touch after our journey. Hungry from the trip, we were soon treated to the best hash browns we’ve ever had—crispy, golden, and delightfully thick, almost the size of a deep-dish, medium pizza! Accompanied by perfectly boiled eggs, a plate of fresh tropical fruits, and organic tea from Sri Lanka’s highlands, the breakfast set the tone for an unforgettable stay. The all-inclusive package included a magical canoeing trip on the serene Rekawa Lagoon and a spectacular beachside dinner. We've never come across an all-inclusive experience of this caliber in Sri Lanka. From the romantic cabins with extra-long beds to the wide, luxurious sunbeds on the private beach, every detail of our stay was designed for comfort and indulgence. The warm hospitality, exquisite food, unlimited drinks, and impeccable service made our experience truly exceptional. It's a real insider tip, still spared from the crowds of tourists ;) We cannot recommend this place enough. If you’re looking for a five-star, all-inclusive getaway where you’ll be pampered from start to finish, Tomorrowland Beach Villas is the place to go! Thank you Pooja! We will come back :) It is perfect to get to know the idyllic and quiet side of Sri Lanka. At the right times you can have the entire beach to yourself. But you shouldn't expect a party mile. Which was perfect for to escape the hustle and bustle of the city.",
    "sentiment": "Positive",
    "categories": [
      "Staff",
      "Food",
      "Location"
    ],
    "source": "Booking.com",
    "date": "Feb 01, 2025",
    "status": "Pending"
  },
  {
    "id": 4,
    "rating": 5,
    "userName": "Georgia",
    "text": "Gorgeous beach villa stay, a welcomed break from the hostel life. I had the pleasure of spending a night at one of Ella’s best-known hostels, Tomorrowland, where I met the owner. During our conversation, he suggested that if I was planning to visit the southern beaches, I should consider staying at their brand-new beach property—Tomorrowland Beach Villas in Rekawa, Tangalle. Although I had already booked accommodations in Mirissa, I decided to take a chance and spend a night at Tomorrowland Beach Villas before heading to my final destination—Kandy. Upon arrival, I was warmly welcomed by the lovely hosts, Irushi and Hiruni, making it one of the most heartfelt greetings I’ve received at a property in Sri Lanka. I was given the Winter Villa, a stunning all-wood cabin perched right at the water’s edge, where the waves crashed just below. For dinner, I indulged in one of Tomorrowland’s specialties—the Pompano Fish, part of an impressive selection of freshly caught seafood. Dining at sunset, right where the waves met the shore, was nothing short of sublime. Adding to the charm, a breakwater runs perpendicular to Tomorrowland’s private beach. The right side forms a serene, blue-water pool, where I enjoyed a leisurely soak until sundown. Although Tomorrowland had arranged an early morning bird-watching lagoon cruise, I ended up sleeping in until 9:00 AM—unfortunately missing the adventure, as I had to rush to catch my transportation to Kandy. Tomorrowland Beach Villas is a paradise for couples who cherish privacy, romance, and a touch of indulgence. I will definitely be returning with my partner next time—and with a few well-earned credits from Tomorrowland Properties, it’s sure to be even more memorable. Five stars all the way! Genuinely everything was amazing. Wouldn’t change a thing :)",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Food"
    ],
    "source": "Booking.com",
    "date": "Feb 01, 2025",
    "status": "Pending"
  },
  {
    "id": 5,
    "rating": 5,
    "userName": "Lisa",
    "text": "Amazing stay, you won’t regret it. I recently had the pleasure of staying a few nights at the picturesque Tomorrowland Hostel in Ella, Sri Lanka, and the hospitality there far surpassed typical hostel standards. During my visit, Pooja, the guest relations officer, recommended their new upscale boutique property, Tomorrowland Beach Villas in Rekawa, Tangalle, for a luxurious all-inclusive experience—and it truly delivered. From the moment I arrived, the experience was nothing short of heavenly. I was warmly welcomed by two gracious hosts who greeted me with a cool, refreshing towel and a glass of freshly squeezed fruit juice. It was early morning, and I was quite hungry, so they treated me to the best hash browns I’ve ever tasted, along with a delicious spread of fresh fruits and organic tea sourced from Sri Lanka’s highlands. The all-inclusive package was a highlight, featuring a memorable canoeing trip on the serene Rekawa Lagoon and a spectacular beachside dinner. The meal included giant shrimp caught fresh during the lagoon adventure—a dining experience I won’t soon forget. I’ve yet to come across an all-inclusive offering quite like this one. It was absolutely worth every moment, and I cannot recommend Tomorrowland Beach Villas enough. The hospitality, cuisine, and service were exceptional in every way. If you’re looking for an unparalleled “all-inclusive” retreat on Sri Lanka’s South Coast, this is the place to go. Five stars, without hesitation!",
    "sentiment": "Positive",
    "categories": [
      "Staff",
      "Food",
      "Location"
    ],
    "source": "Booking.com",
    "date": "Dec 01, 2024",
    "status": "Pending"
  },
  {
    "id": 6,
    "rating": 4,
    "userName": "Markus",
    "text": "Great place to stay directly at the water, very close to the beach. Great location directly at the beach. You can safely swim in the harbor – the beaches are beautiful but supposedly not safe for swimming. It is a nice place and the host is extremely helpful in all matters. Aircondition, fans etc. are all brand new and in best order and everything seems to be well thought through. All seemed sparkling clean to me. The villas are not huge. You can store your bags under the bed. No problem if the weather is nice.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Cleanliness"
    ],
    "source": "Booking.com",
    "date": "Jan 01, 2026",
    "status": "Pending"
  },
  {
    "id": 7,
    "rating": 5,
    "userName": "Alex",
    "text": "Природа на Шри-Ланке замечательная, место идеальное и хозяин был замечательный человек и собеседник. Отличное местоположение. В минуте ходьбы находится тихая закрытая бухта, где можно спокойно купаться. Рядом конечно есть и открытый пляж с огромными океанскими волнами. Останавливались на одну неделю и отдых был замечательный. Красивая природа, большое разнообразие различной животности, которая для городского европейского жителя совсем не привычна. Большое спасибо гостеприимному и отзывчивому хозяину. Он организовал и поездку на каное по лагуне с манговыми зарослями, ночное посещение пляжами с большими морскими черепахами, посещение слонового заповедника и двухдневную поездку в горы в Елу. Все было замечательно.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Food"
    ],
    "source": "Booking.com",
    "date": "Dec 01, 2025",
    "status": "Pending"
  },
  {
    "id": 8,
    "rating": 5,
    "userName": "Rhijja",
    "text": "Exceptional. Superlieve mensen die er alles aan doen om het je naar de zin te maken. Geweldig klein maar fijn hutje pal aan de zee van alle gemakken voorzien: goede airco, enorm bed, schoon en mooie badkamer. Koude douche helemaal prima na een duik in zee. Wifi is snel en werkt top. Rustige baai waar je veilig kunt zwemmen. Zalig grote en comfortabele ligbedden waar je niet meer vanaf komt. Een plek om helemaal tot rust te komen. In slaap vallen en wakker worden met zeegeluiden. Het strand is niet heel paradijselijk, maar wel fijn dat je er veilig in zee kunt zwemmen.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Comfort",
      "Staff"
    ],
    "source": "Booking.com",
    "date": "Nov 01, 2025",
    "status": "Pending"
  },
  {
    "id": 9,
    "rating": 5,
    "userName": "Marco",
    "text": "Exceptional. Herrliche Unterkunft um abzuschalten und die Ruhe zu genießen. Sehr freundliches Personal und vor allem fantastisches Essen das mit Sicherheit das beste auf meiner Sri Lanka Reise war! Auch bei jeglichen Fragen oder der Organisation zum Weiterreisen wird einem geholfen und den Menschen dort lag wirklich alles daran mir den Aufenthalt so angenehm wie möglich zu gestalten.",
    "sentiment": "Positive",
    "categories": [
      "Staff",
      "Food",
      "Comfort"
    ],
    "source": "Booking.com",
    "date": "Sep 01, 2025",
    "status": "Pending"
  },
  {
    "id": 10,
    "rating": 5,
    "userName": "AAnna3181",
    "text": "Exceptional. Хотели сказать большое спасибо за потрясающий отдых, мы искали именно такой релакс и домашнюю обстановку. Отдельное спасибо хозяину отеля Удея и его помощницам, за их гостеприимство и душевную атмосферу, юмор и понимание. Пляж находится буквально в пару метров от отеля, песчаный берег, есть заграждение от волн, и было комфортно и безопасно купаться. Шезлонги широкие и комфортные. Уборка в доме проводилась каждый день. Из гостей были только мы и ощутили полное уединение. Каждый день нас баловали местными национальными блюдами, все очень было вкусно и необычно. Больше всего понравились карри и жареные креветки. В день прибытия мы праздновали день рождения, персонал поздравил великолепным тортом и шариками. Также нам организовали две экскурсии: прогулку на каноэ по реке Рекава и поездку к черепахам. Мы отлично отдохнули и зарядились только положительными эмоциями. Рекомендуем отель тем, кто ищет релакс и тишину, засыпать и просыпаться под шум волны с чудесными видами прям из окна небольшого, но уютного бунгало. Все понравилось.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Food",
      "Staff"
    ],
    "source": "Booking.com",
    "date": "Sep 01, 2025",
    "status": "Pending"
  },
  {
    "id": 11,
    "rating": 5,
    "userName": "Yannick",
    "text": "Strandhütten wie im Paradies. Sehr gemütliche Strandhütten direkt am Meer! Schön eingerichtet und mit Klima, sodass man sich sehr wohl fühlt, Mückennetze sind sogar vorhanden, obwohl ich keine Mücke gesehen hab. Die Lage ist zwar etwas außerhalb, dafür aber sehr schön ruhig, wie man sich das Tropenparadies vorstellt. Die Anlage ist sehr schön und sauber gehalten, auch außerhalb der Hauptsaison. Am besten haben mir aber der mega liebe Besitzer und seine Bediensteten gefallen, die Rund um die Uhr für mich da waren und sogar tolle Ausflüge (zB Schildkröten beobachten) für mich organisiert haben und mir beim Weitertransport geholfen haben. PS: Ihr müsst dort auch unbedingt essen, gekocht wird wahnsinnig gut. Nichts, ich war mit allem mehr als zufrieden.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Food"
    ],
    "source": "Booking.com",
    "date": "May 01, 2025",
    "status": "Pending"
  },
  {
    "id": 12,
    "rating": 5,
    "userName": "Iris",
    "text": "Hervorragende Unterkunft zum relaxen am Meer. Die Lage war perfekt. Anwesen mit mehreren kleinen Bungalows, Palmen, große gemütliche Sonnenliegen und Sitzmöglichkeiten im Schatten. Wir hatten einen kleinen Bungalow mit Meerblick, alles sauber, gemütlich und durchdacht. Abwechslungsreiches Frühstück war inklusive. Es wurde sogar auf die eigene kleine Terrasse gebracht. Das Personal war super freundlich und der Besitzer hat uns ganz viele Tipps für die Umgebung gegeben und teilweise auch organisiert. Schwimmen im Meer war auch direkt vor der Haustür möglich. Wer Ruhe und Entspannung sucht, ist hier genau richtig.",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Comfort"
    ],
    "source": "Booking.com",
    "date": "Mar 01, 2025",
    "status": "Pending"
  },
  {
    "id": 13,
    "rating": 5,
    "userName": "Paolo",
    "text": "Dormire di fonte al mare col rumore dell’oceano è fantastico! L’accoglienza del personale sempre sorridente e disponibile e la posizione fronte mare, e il cibo semplice ma ottimo !!",
    "sentiment": "Positive",
    "categories": [
      "Location",
      "Staff",
      "Food"
    ],
    "source": "Booking.com",
    "date": "Feb 01, 2025",
    "status": "Pending"
  },
  {
    "id": 14,
    "rating": 5,
    "userName": "Jil",
    "text": "Ein wunderbarer Aufenthalt. In der Unterkunft angekommen wurde man sehr freundlich von dem Besitzer empfangen. Dort wurde einem sofort ein sehr leckerer Papayasaft bereitgestellt. Weitergehend wurde wir in unser Bungalow geführt, welcher echt sehr gemütlich und modern ist. Sehr gut gefallen hat mir außerdem noch, dass man von dem Bett aus aufs Meer schauen kann. Besonders schön bei dem Sonnenaufgang. Der Service ist rund um die Uhr verfügbar. Hier wird jeder Wunsch umgesetzt. Der Besitzer ist sehr lieb und verfügt über sehr gute Englisch Kenntnisse, welche die Kommunikation recht einfach machen. Das Schildkröten Watching und der Canyon Cruise, welchen wir über die Unterkunft gebucht haben, war ein tolles Erlebnis. Die Unterkunft verfügt noch über eine Restaurant. Dort gibt es leckeres traditionelles Essen, sowie internationale Gerichte, welche sehr zu empfehlen sind. Zum Schluss kann ich noch erwähnen, dass der Aufenthalt uns sehr gut gefallen hat und wir jederzeit wiederkommen würden. Nichts",
    "sentiment": "Positive",
    "categories": [
      "Staff",
      "Location",
      "Food"
    ],
    "source": "Booking.com",
    "date": "Feb 01, 2025",
    "status": "Pending"
  },
  {
    "id": 15,
    "rating": 5,
    "userName": "Anni",
    "text": "Exceptional.",
    "sentiment": "Positive",
    "categories": [],
    "source": "Booking.com",
    "date": "Mar 01, 2025",
    "status": "Pending"
  }
]